app/Http/Controllers/Auth/LoginController.php

    public function login(Request $request)
    {
        // Know a name or usnea name is comming
        //print_r($_POST);

        // Get data form
        $data = [
            'email'     => $_POST['email'],
            'password'  => $_POST['password'],
            'status'    => 1
        ];

        // Validate user Exists
        if ( !$user = User::where('email',$_POST['email'])->first())
---
select * from `users` where `email` = 'kromaguera@example.org' limit 1

            {
                $user->last_login_attempt = Carbon::now();

                $user->save();
---
update `users` set `login_attempts` = 1, `last_login_attempt` = '2020-02-07 17:30:44', `updated_at` = '2020-02-07 17:30:44' where `id` = 1

            }
            else
            {
                $change_password_days = ChangePasswordDay::where('state_id', 1)->first();
---
select * from `change_password_days` where `state_id` = 1 limit 1