app/Http/Controllers/PerfilController.php

    public function index()
    {
        $id_usuario = Auth::user()->id;
        $user = User::find($id_usuario);
---
select * from `users` where `users`.`id` = 1 limit 1

    public function show($id)
    {
        //
        $user = User::find($id);
---
select * from `users` where `users`.`id` = '1' limit 1

    public function edit($id)
    {
        //
        $user = User::find($id);
---
select * from `users` where `users`.`id` = '2' limit 1

    public function verifyPassword()
    {
        if($_GET['newPassword'] != "")
        {
            // Segun el perfil del usuario, verifica el tamaño de la contraseña
            $pwd = $_GET['newPassword'];
            if(Auth::user())
            {
                $user = User::find(Auth::user()->id);
---
select * from `users` where `users`.`id` = 2 limit 1

    public function getKeyWords( $str , $keys = array() )
    {
        if(Auth::user())
        {
            $dataUser = User::find(Auth::user()->id);
---
select * from `users` where `users`.`id` = 2 limit 1

    public function consultarPassword( $pwd )
    {
        if(Auth::user())
        {
            $user = Auth::user()->id;
            // take the last 10 password
            $oldPassword = LastPasswordUser::where('user',$user)->latest()->take(10)->get();
---
select * from `lasts_password_users` where `user` = 2 order by `created_at` desc limit 10