app/Http/Controllers/UserController.php

select * from `users`
---
    public function index(Request $request)
    {
        $users = User::all();

select `name`, `id` from `roles`
---
    public function create()
    {
        $roles = Role::pluck('name', 'id');

insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('uno mas', 'algun@correo.com', 'y$jqNWn4sqlZhGpK2vPaN5V.ghgnAxaLnVJ8XKhkaIidWCGqFklbJUO', '2020-02-07 19:51:26', '2020-02-07 19:51:26')
---
        //$request->merge(['password' => bcrypt($request->get('password'))]);
        // Create the user
        //if ( $user = User::create($request->except('roles', 'permissions')) )
        if($user->save())

select * from `roles` where `roles`.`id` = '1' limit 1
---
    public static function syncPermissions(Request $request, $user)
    {
        // Get the submitted roles
        $roles = $request->get('roles', []);
        $permissions = $request->get('permissions', []);

        // Get the roles
        $roles = Role::find($roles);